#### FailureMessageKey Members

---

|  |
| --- |
| FailureMessageKey Class   Constructors   Methods   Operators   Properties   See Also |

The  FailureMessageKey  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FailureMessageKey | Constructs a new FailureMessageKey with default settings. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FailureMessageKey |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Overrides  Object Equals(Object)  .) |
| Public method | GetHashCode | Gets the integer value of the id as hash code (Overrides  Object GetHashCode  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsEqual | Checks it this key is equal to the other. |
| Public method | IsValid | Checks if the failure message key is valid |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Determines whether two FailureMessageKeys are the same. |
| Public operator Static member | Inequality | Determines whether two FailureMessageKeys are different. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FailureMessageKey Class

Autodesk.Revit.DB Namespace